In [1]:
import pandas as pd
data={
    "calories":[234,654,987],
    "duration":[30,20,40],
    "age":[25,25,None]
}
df=pd.DataFrame(data)
df

   calories  duration   age
0       234        30  25.0
1       654        20  25.0
2       987        40   NaN

In [3]:
df=df.dropna()
df

   calories  duration   age
0       234        30  25.0
1       654        20  25.0

In [15]:
import pandas as pd
data1={
    "weight":[34,56,None],
    "name":["anu","manu","anju"],
    "age":[23,24,19]
}
df1=pd.DataFrame(data1)
df1

   weight  name  age
0    34.0   anu   23
1    56.0  manu   24
2     NaN  anju   19

In [17]:
df1=df1.fillna({'weight':42})
df1

   weight  name  age
0    34.0   anu   23
1    56.0  manu   24
2    42.0  anju   19